[
  {
     "id":1,
     "speaker":"Andrea Gagna",
     "title":"Oplax 3-functors",
     "abstract":"We motivate the introduction of a notion of normalized oplax 3-functors from a homotopical point of view. We explain the algebra of trees needed for the definition and show that they induce a canonical simplicial morphism. Finally, we characterize the simplicial morphisms between nerves coming from normalized oplax 3-functors.",
     "affil":"Karlova Univerzita"
  },
  {
     "id":1,
     "speaker":"Nicola Gambino",
     "title":"Variations on distributive laws",
     "abstract":"The notion of a distributive law between monads goes back to fundamental work of Jon Beck from the late '60s. Just as a monad describes a kind of algebraic structure, a distributive law between two monads describes how the algebraic structure for one monad distributes over the algebraic structure for the other, as in the notion of a ring (where products distribute over sums). I will give a survey of variations of distributive laws, according to three orthogonal directions: replacing monads with relative monads (in the sense of Altenkirch et al), replacing categories with objects of a 2-category (à la Street), and increasing categorical dimension. One application is to substitution monoidal structures and operads. This is based on joint work with Fiore, Hyland and Winskel and recent joint work with Lobbia.",
     "affil":"University of Leeds"
  },
  {
     "id":2,
     "speaker":"Milly Maietti",
     "title":"Predicative generalizations of topos-like structures",
     "abstract":"Predicative generalizations of the notion of elementary topos had been already investigated in the literature starting from the work by I. Moerdijk and E. Palmgren and later by B. van der Berg. In this talk we propose generalizations of the concept of arithmetic quasi-topos and hence of elementary topos which enjoy an internal language which is predicative a' la Russell and are such that when applying suitable reducibility axioms we get the original (impredicative) notions back. The main difference with previous notions of predicative toposes is that in our notions we just require a non-iterative power-object construction. Genuine examples of quasi-toposes and predicative toposes may be built by employing the notion of elementary quotient completion introduced in joint work with P. Rosolini and applied to predicative versions of triposes in replacement to the usual Hyland-Johnstone-Pitts's tripos-to-topos construction.",
     "affil":"Università di Padova"
  },
  {
     "id":2,
     "speaker":"Alessio Santamaria",
     "title":"Towards a Calculus of Substitution for Dinatural Transformations",
     "abstract":" In 1972, with the papers \"Many-Variable Functorial Calculus, I\" and \"An Abstract Approach of Coherence\", Kelly started a long-term project on achieving an abstract theory of coherence. To do so, he argues that a \"tidy calculus of substitution\" of functors in many variables and appropriately general natural transformations is in order; such a calculus ought to generalise the usual Godement calculus of functors in one variable and ordinary natural transformations. Inspired by the work he did with Eilenberg on extranatural transformations in 1966, he developed this calculus for (many-variable) covariant functors and natural transformations. Upon trying the mixed-variance case, he ran into problems linked to the fact that extranaturals do not compose. In this talk, I will show how we realised that the full mixed-variance case wanted by Kelly involves a simple generalisation of dinatural transformations; a sufficient and essentially necessary condition for two consecutive dinatural transformations to compose will be mentioned, and I will present a new definition of horizontal composition of dinaturals. Armed with these results, I will show how to achieve he first steps made by Kelly (in the mixed-variance case, this time) towards a full substitution calculus. There are still some conceptual difficulties about the remaining steps which are yet to be overcome.",
     "affil":"Università di Pisa"
  },
  {
     "id":3,
     "speaker": "Enrico Ghiorzi",
     "title": "Complete internal categories",
     "abstract": "Size issues are a common pathology afflicting category theory by getting in the way of otherwise natural results. While small categories are immune to size issues, the only complete ones are partial orders. So, internal category theory, which generalizes the theory of small categories while featuring notable examples of completeness, appears as an attractive setting. Remarkably, complete internal categories are also cocomplete and the adjoint functor theorem requires no solution set condition. Unfortunatly, there is no internal base category playing the role of the category of sets. Consequently, fundamental results such as the Yoneda lemma cannot be internalized. This motivates the developement of a theory of internal enrichment, combining the good behaviour of internal categories with the expressivity of enriched category theory.",
     "affil": "Appalachian State University"
  },
  {
     "id":3,
     "speaker": "Paolo Perrone",
     "title": "Colimits as algebraic operations",
     "abstract": "In this work we study colimits of diagrams from the point of view of 2-dimensional universal algebra, treating them as an algebraic operation that one can take on diagrams, or on presheaves. These operations satisfy coherence conditions automatically, coming from the universal property of colimits. As first stated by René Guitart, small diagrams form a pseudomonad on the category of locally small categories, with multiplication given by the Grothendieck construction. Cocomplete categories with a choice of colimit for each diagram are pseudoalgebras over this monad, via a (known) generalization of the usual Fubini theorem for colimits. Not all pseudoalgebras arise in this way, as we show. We assign to each small diagram a presheaf by taking the \"free colimit\". We call this construction the \"image presheaf\". We show that \"having the same image presheaf\" is a stronger condition than having the same colimit, which generalizes the concept of \"final/cofinal functor\". Moreover, the presheaves that arise as images of small diagrams (called \"small presheaves\") form themselves a pseudomonad, whose algebras are exactly cocomplete categories (as shown by Steve Lack). We show that taking the image gives a morphism of pseudomonads, so that cocomplete categories can be seen as being Diagram-algebras via a generalization of the classical restriction of scalars construction. Finally, we can instantiate the theory of partial evaluations (suitably extended to the 2-dimensional context) for these particular pseudomonads, and show how partial evaluations of colimits correspond exactly to pointwise left Kan extensions (\"Kan extensions are partial colimits\"). Upon interest, we may also discuss a tight analogy with the monads of probability theory, which has largely motivated this investigation. Joint work with Walter Tholen.",
     "affil": "MIT Department of Mathematics"
  },
  {
     "id":4,
     "speaker": "Martina Rovelli",
     "title": "Towards an explicit comparison between globular and simplicial models of (∞,2)-categories",
     "abstract": "Many mathematical objects of interest assemble naturally into what is referred to as an (∞,n)-category, a notion that can be implemented by means of several models, each presenting its own advantages and disadvantages. Amongst those, there are Rezk’s globular model of $\\,\\Theta_n$-spaces and Verity’s simplicial model of saturated n-complicial sets. The equivalence between those has been established for n=0,1,2, although only for n=0,1 an explicit comparison is available. I will present work in progress (joint with J. Bergner and V. Ozornova) towards producing an explicit comparison between the two approaches in the case n=2 or higher.",
     "affil": "MSI - Australian National University"
  },
  {
     "id":4,
     "speaker": "Simone Virili",
     "title": "Factorization Systems on Derivators",
     "abstract": "Factorization systems are an important part of modern category theory, as they can be found in very common situations. Furthermore, they provide the category where they live in with a rather rich structure. In this talk we extend this classical theory introducing a higher version of this concept, called derivator factorization systems, in the language of Grothendieck (pre)derivators. We will present three different approaches to derivator factorization system: as suitable pairs of \"coherently orthogonal\" sub-derivators, as \"factorization functors\" and as pseudoalgebras over the squaring monad. An important result will then be to prove that, in discrete derivators (i.e., the derivators enhancing classical category theory) and in stable derivators (i.e., the derivators enhancing triangulated categories), these three approaches are all equivalent. Finally, we will show that, when a derivator originates from a stable ∞-category, the derivator factorization systems are in bijection with the (homotopy) factorization systems introduced by Joyal.",
     "affil": "Università di Udine"
  }
  {
     "id":5,
     "speaker":"Davide Trotta",
     "title":"The existential completion, choice principles and applications",
     "abstract":"Hyperdoctrines were introduced by F.W. Lawvere to synthesize the structural properties of logical systems. The intuition is that a hyperdoctrine determines an appropriate categorical structure to abstract both notions of first-order theory and interpretation. In some recent works, Maietti and Rosolini generalized the notion of hyperdoctrine, introducing that of elementary and existential doctrine to give an abstract description of constructions used to formalize constructive mathematics in foundations based on intensional type theory. The main goal of this talk is to present the existential completion of an elementary doctrine, its connections with some choice principles and applications. First, we show that this construction allows us to extend the notion of exact completion to an arbitrary elementary doctrine, i.e. we prove that there is a bi-adjunction between the 2-category of elementary doctrines into the 2-category of exact categories. Then, employing the existential completion, we provide an algebraic characterization of some choice principles, including Hilbert’s epsilon operator. Finally, we present various examples of existential completions, including the syntactic doctrine of the regular logic, the doctrine of variations on a finite product category with weak equalizers, the subobject doctrine on a finitely complete category, and the doctrine of formal monomorphisms associated with an M-category." 
  },
  {
   "id":5,
   "speaker":"Denis Nardin",
   "title":"Equivariant multiplicative structures",
   "abstract":"I will explain some ideas to encode multiplicative structures arising in equivariant homotopy theory (in particular the Hill-Hopkins-Ravenel norm) via the framework of parametrized higher category theory. I will show how this can be thought of a generalization of ordinary multiplicative structures and present how it can be used to give a universal property of the Hill-Hopkins-Ravenel norm." 
},
{
   "id":6,
   "speaker":"Pino Rosolini",
   "title":"The Comonad of Identities",
   "abstract":"" 
},
{
   "id":6,
   "speaker":"Fosco Loregian",
   "title":"Coends of higher arity",
   "abstract":"We specialise a recently introduced notion of generalised dinaturality to the case where the domain (resp., codomain) is constant, obtaining notions of ends (resp., coends) of higher arity, dubbed herein (p,q)-ends (resp., (p,q)-coends). While higher arity co/ends are particular instances of 'totally symmetrised' (ordinary) co/ends, they serve an important technical role in the study of a number of new categorical phenomena, which may be broadly classified as two new variants of category theory.  The first of these, weighted category theory, consists of the study of weighted variants of the classical notions and construction found in ordinary category theory, besides that of a limit. This leads to a host of varied and rich notions, such as weighted Kan extensions, weighted adjunctions, and weighted ends. The second, diagonal category theory, proceeds in a different (albeit related) direction, in which one replaces universality with respect to natural transformations with universality with respect to dinatural transformations, mimicking the passage from limits to ends. In doing so, one again encounters a number of new interesting notions, among which one similarly finds diagonal Kan extensions, diagonal adjunctions, and diagonal ends." 
},
{
   "id":6,
   "speaker":"Simona Paoli",
   "title":"Weakly globular double categories and weak units",
   "abstract":"Weakly globular double categories are a model of weak 2-categories based on the notion of weak globularity, and they are known to be suitably equivalent to Tamsamani 2-categories. Fair 2-categories, introduced by J. Kock, model weak 2-categories with strictly associative compositions and weak unit laws. In this talk I will illustrate how to establish a direct comparison between weakly globular double categories and fair 2-categories and prove they are equivalent after localisation with respect to the 2-equivalences. This comparison sheds new light on weakly globular double categories as encoding a strictly associative, though not strictly unital, composition, as well as the category of weak units via the weak globularity condition." 
},
{
   "id":6,
   "speaker":"Giacomo Tendas",
   "title":"Equivalent characterizations of accessible V-categories",
   "abstract":"" 
}
]